espressif/esp-idf/components/soc/esp32c5/register/soc/twaifd_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: ID register */
/** Type of device_id_version register
 *  TWAI FD device id status register
 */
typedef union {
    struct {
        /** device_id : RO; bitpos: [15:0]; default: 51965;
         *  Represents whether CAN IP function is mapped correctly on its base address.
         */
        uint32_t device_id:16;
        /** ver_minor : RO; bitpos: [23:16]; default: 4;
         *  TWAI FD IP version
         */
        uint32_t ver_minor:8;
        /** ver_major : RO; bitpos: [31:24]; default: 2;
         *  TWAI FD IP version
         */
        uint32_t ver_major:8;
    };
    uint32_t val;
} twaifd_device_id_version_reg_t;


/** Group: Configuration register */
/** Type of mode_settings register
 *  TWAI FD mode setting register
 */
typedef union {
    struct {
        /** rst : WO; bitpos: [0]; default: 0;
         *  Soft reset. Writing logic 1 resets CAN FD. After writing logic 1, logic 0 does
         *  not need to be written, this bit
         *  is automatically cleared.
         *  0: invalid
         *  1: reset.
         */
        uint32_t rst:1;
        /** bmm : R/W; bitpos: [1]; default: 0;
         *  Bus monitoring mode. In this mode CAN FD only receives frames and sends only
         *  recessive bits on CAN
         *  bus. When a dominant bit is sent, it is re-routed internally so that bus value is
         *  not changed. When this mode is
         *  enabled, CAN FD will not transmit any frame from TXT Buffers,
         *  0b0 - BMM_DISABLED - Bus monitoring mode disabled.
         *  0b1 - BMM_ENABLED - Bus monitoring mode enabled.
         */
        uint32_t bmm:1;
        /** stm : R/W; bitpos: [2]; default: 0;
         *  Self Test Mode. In this mode transmitted frame is considered valid even if dominant
         *  acknowledge was not received.
         *  0b0 - STM_DISABLED - Self test mode disabled.
         *  0b1 - STM_ENABLED - Self test mode enabled.
         */
        uint32_t stm:1;
        /** afm : R/W; bitpos: [3]; default: 0;
         *  Acceptance Filters Mode. If enabled, only RX frames which pass Frame filters are
         *  stored in RX buffer. If disabled,
         *  every received frame is stored to RX buffer. This bit has meaning only if there is
         *  at least one filter available.
         *  Otherwise, this bit is reserved.
         *  0b0 - AFM_DISABLED - Acceptance filter mode disabled
         *  0b1 - AFM_ENABLED - Acceptance filter mode enabled
         */
        uint32_t afm:1;
        /** fde : R/W; bitpos: [4]; default: 1;
         *  Flexible data rate enable. When flexible data rate is enabled CAN FD recognizes
         *  CAN FD frames (FDF bit
         *  = 1).
         *  0b0 - FDE_DISABLE - Flexible data-rate support disabled.
         *  0b1 - FDE_ENABLE - Flexible data-rate support enabled.
         */
        uint32_t fde:1;
        /** tttm : R/W; bitpos: [5]; default: 0;
         *  Time triggered transmission mode.
         *  0b0 - TTTM_DISABLED -
         *  0b1 - TTTM_ENABLED -
         */
        uint32_t tttm:1;
        /** rom : R/W; bitpos: [6]; default: 0;
         *  Restricted operation mode.
         *  0b0 - ROM_DISABLED - Restricted operation mode is disabled.
         *  0b1 - ROM_ENABLED - Restricted operation mode is enabled.
         */
        uint32_t rom:1;
        /** acf : R/W; bitpos: [7]; default: 0;
         *  Acknowledge Forbidden Mode. When enabled, acknowledge is not sent even if received
         *  CRC matches the calculated
         *  one.
         *  0b0 - ACF_DISABLED - Acknowledge forbidden mode disabled.
         *  0b1 - ACF_ENABLED - Acknowledge forbidden mode enabled.
         */
        uint32_t acf:1;
        /** tstm : R/W; bitpos: [8]; default: 0;
         *  Test Mode. In test mode several registers have special features. Refer to
         *  description of Test mode for further
         *  Details.
         */
        uint32_t tstm:1;
        /** rxbam : R/W; bitpos: [9]; default: 1;
         *  RX Buffer automatic mode.
         *  0b0 - RXBAM_DISABLED -
         *  0b1 - RXBAM_ENABLED -
         */
        uint32_t rxbam:1;
        /** txbbm : R/W; bitpos: [10]; default: 0;
         *  TXT Buffer Backup mode\\
         *  0b0 - TXBBM_DISABLED - TXT Buffer Backup mode disabled\\
         *  0b1 - TXBBM_ENABLED - TXT Buffer Backup mode enabled\\
         */
        uint32_t txbbm:1;
        uint32_t reserved_11:5;
        /** rtrle : R/W; bitpos: [16]; default: 0;
         *  Retransmitt Limit Enable. If enabled, CAN FD only attempts to retransmitt each
         *  frame up to RTR_TH
         *  times.
         *  0b0 - RTRLE_DISABLED - Retransmitt limit is disabled.
         *  0b1 - RTRLE_ENABLED - Retransmitt limit is enabled.
         */
        uint32_t rtrle:1;
        /** rtrth : R/W; bitpos: [20:17]; default: 0;
         *  Retransmitt Limit Threshold. Maximal amount of retransmission attempts when
         *  SETTINGS[RTRLE] is en-
         *  Abled.
         */
        uint32_t rtrth:4;
        /** ilbp : R/W; bitpos: [21]; default: 0;
         *  Internal Loop Back mode. When enabled, CAN FD receives any frame it transmits.
         *  0b0 - INT_LOOP_DISABLED - Internal loop-back is disabled.
         *  0b1 - INT_LOOP_ENABLED - Internal loop-back is enabled.
         */
        uint32_t ilbp:1;
        /** ena : R/W; bitpos: [22]; default: 0;
         *  Main enable bit of CAN FD. When enabled, CAN FD communicates on CAN bus.
         *  When disabled, it
         *  is bus-off and does not take part of CAN bus communication.
         *  0b0 - CAN_DISABLED - The CAN Core is disabled.
         *  0b1 - CAN_ENABLED - The CAN Core is enabled.
         */
        uint32_t ena:1;
        /** nisofd : R/W; bitpos: [23]; default: 0;
         *  Non ISO FD. When this bit is set, CAN FD is compliant to NON-ISO CAN FD
         *  specification (no stuff
         *  count field). This bit should be modified only when SETTINGS[ENA]=0.
         *  0b0 - ISO_FD - The CAN Controller conforms to ISO CAN FD specification.
         *  0b1 - NON_ISO_FD - The CAN Controller conforms to NON ISO CAN FD specification.
         *  CANFD 1.0
         */
        uint32_t nisofd:1;
        /** pex : R/W; bitpos: [24]; default: 0;
         *  Protocol exception handling. When this bit is set, CAN FD will start
         *  integration upon detection of protocol
         *  exception. This should be modified only when SETTINGS[ENA] = ’0’.
         *  0b0 - PROTOCOL_EXCEPTION_DISABLED - Protocol exception handling is disabled.
         *  0b1 - PROTOCOL_EXCEPTION_ENABLED - Protocol exception handling is enabled.
         */
        uint32_t pex:1;
        /** tbfbo : R/W; bitpos: [25]; default: 1;
         *  All TXT buffers shall go to "TX failed" state when CAN FD becomes bus-off.
         *  0b0 - TXTBUF_FAILED_BUS_OFF_DISABLED - TXT Buffers dont go to "TX failed" state
         *  when CAN
         *  FD becomes bus-off.
         *  0b1 - TXTBUF_FAILED_BUS_OFF_ENABLED - TXT Buffers go to "TX failed" state when
         *  CAN FD
         *  becomes bus-off.
         */
        uint32_t tbfbo:1;
        /** fdrf : R/W; bitpos: [26]; default: 0;
         *  Frame filters drop Remote frames.
         *  0b0 - DROP_RF_DISABLED - Frame filters accept RTR frames.
         *  0b1 - DROP_RF_ENABLED - Frame filters drop RTR frames.
         */
        uint32_t fdrf:1;
        /** pchke : R/W; bitpos: [27]; default: 0;
         *  Enable Parity checks in TXT Buffers and RX Buffer.
         */
        uint32_t pchke:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} twaifd_mode_settings_reg_t;

