espressif/esp-idf/components/soc/esp32c5/register/soc/twaifd_struct.h
/** Type of command register
 *  TWAI FD command register
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** rxrpmv : WO; bitpos: [1]; default: 0;
         *  RX Buffer read pointer move.
         */
        uint32_t rxrpmv:1;
        /** rrb : WO; bitpos: [2]; default: 0;
         *  Release RX Buffer. This command flushes RX buffer and resets its memory pointers.
         *  0: invalid
         *  1: delete
         */
        uint32_t rrb:1;
        /** cdo : WO; bitpos: [3]; default: 0;
         *  Clear Data Overrun flag in RX buffer.
         *  0: invalid
         *  1: clear
         */
        uint32_t cdo:1;
        /** ercrst : WO; bitpos: [4]; default: 0;
         *  Error Counters Reset. When unit is bus off, issuing this command will request
         *  erasing TEC, REC counters after
         *  128 consecutive occurrences of 11 recessive bits. Upon completion, TEC and REC are
         *  erased and fault confinement
         *  State is set to error-active. When unit is not bus-off, or when unit is bus-off due
         *  to being disabled (SETTINGS[ENA]
         *  = ’0’), this command has no effect.
         */
        uint32_t ercrst:1;
        /** rxfcrst : WO; bitpos: [5]; default: 0;
         *  Clear RX bus traffic counter (RX_COUNTER register).
         */
        uint32_t rxfcrst:1;
        /** txfcrst : WO; bitpos: [6]; default: 0;
         *  Clear TX bus traffic counter (TX_COUNTER register).
         */
        uint32_t txfcrst:1;
        /** cpexs : WO; bitpos: [7]; default: 0;
         *  Clear Protocol exception status (STATUS[PEXS]).
         */
        uint32_t cpexs:1;
        /** crxpe : WO; bitpos: [8]; default: 0;
         *  Clear STATUS[RXPE] flag.
         */
        uint32_t crxpe:1;
        /** ctxpe : WO; bitpos: [9]; default: 0;
         *  Clear STATUS[TXPE] flag.
         */
        uint32_t ctxpe:1;
        /** ctxdpe : WO; bitpos: [10]; default: 0;
         *  Clear STATUS[TXDPE] flag.
         */
        uint32_t ctxdpe:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} twaifd_command_reg_t;

/** Type of int_stat register
 *  TWAI FD command register
 */
typedef union {
    struct {
        /** rxi_int_st : R/W1C; bitpos: [0]; default: 0;
         *  The masked interrupt status of TWAIFD_RXI_INT.
         *  Frame received interrupt.
         */
        uint32_t rxi_int_st:1;
        /** txi_int_st : R/W1C; bitpos: [1]; default: 0;
         *  The masked interrupt status of TWAIFD_TXI_INT.
         *  Frame transmitted interrupt.
         */
        uint32_t txi_int_st:1;
        /** ewli_int_st : R/W1C; bitpos: [2]; default: 0;
         *  The masked interrupt status of TWAIFD_EWLI_INT.
         *  Error warning limit interrupt. When both TEC and REC are lower than EWL and one of
         *  the becomes equal to or
         *  higher than EWL, or when both TEC and REC become less than EWL, this interrupt is
         *  generated. When Interrupt
         *  is cleared and REC, or TEC is still equal to or higher than EWL, Interrupt is not
         *  generated again.
         */
        uint32_t ewli_int_st:1;
        /** doi_int_st : R/W1C; bitpos: [3]; default: 0;
         *  The masked interrupt status of TWAIFD_DOI_INT.
         *  Data overrun interrupt. Before this  Interrupt is cleared , STATUS[DOR] must be
         *  cleared to avoid setting of this
         *  Interrupt again.
         */
        uint32_t doi_int_st:1;
        /** fcsi_int_st : R/W1C; bitpos: [4]; default: 0;
         *  The masked interrupt status of TWAIFD_FCSI_INT.
         *  Fault confinement state changed interrupt. Interrupt is set when node turns
         *  error-passive (from error-active),
         *  bus-off (from error-passive) or error-active (from bus-off after reintegration or
         *  from error-passive).
         */
        uint32_t fcsi_int_st:1;
        /** ali_int_st : R/W1C; bitpos: [5]; default: 0;
         *  The masked interrupt status of TWAIFD_ALI_INT.
         *  Arbitration lost interrupt.
         */
        uint32_t ali_int_st:1;
        /** bei_int_st : R/W1C; bitpos: [6]; default: 0;
         *  The masked interrupt status of TWAIFD_BEI_INT.
         *  Bus error interrupt.
         */
        uint32_t bei_int_st:1;
        /** ofi_int_st : R/W1C; bitpos: [7]; default: 0;
         *  The masked interrupt status of TWAIFD_OFI_INT.
         *  Overload frame interrupt.
         */
        uint32_t ofi_int_st:1;
        /** rxfi_int_st : R/W1C; bitpos: [8]; default: 0;
         *  The masked interrupt status of TWAIFD_RXFI_INT.
         *  RX buffer full interrupt.
         */
        uint32_t rxfi_int_st:1;
        /** bsi_int_st : R/W1C; bitpos: [9]; default: 0;
         *  The masked interrupt status of TWAIFD_BSI_INT.
         *  Bit rate shifted interrupt.
         */
        uint32_t bsi_int_st:1;
        /** rbnei_int_st : R/W1C; bitpos: [10]; default: 0;
         *  The masked interrupt status of TWAIFD_RBNEI_INT.
         *  RX buffer not empty interrupt. Clearing this interrupt and not reading out content
         *  of RX Buffer via RX_DATA
         *  will re-activate the interrupt.
         */
        uint32_t rbnei_int_st:1;
        /** txbhci_int_st : R/W1C; bitpos: [11]; default: 0;
         *  The masked interrupt status of TWAIFD_TXBHCI_INT.
         *  TXT buffer HW command interrupt. Anytime TXT buffer receives HW command from CAN
         *  Core which
         *  changes TXT buffer state to "TX OK", "Error" or "Aborted", this interrupt will be
         *  generated.
         */
        uint32_t txbhci_int_st:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} twaifd_int_stat_reg_t;

/** Type of btr register
 *  TWAI FD bit-timing  register
 */
typedef union {
    struct {
        /** prop : R/W; bitpos: [6:0]; default: 5;
         *  Configures the propagation segment of nominal bit rate.
         *  Measurement unit: time quanta
         */
        uint32_t prop:7;
        /** ph1 : R/W; bitpos: [12:7]; default: 3;
         *  Configures the phase 1 segment of nominal bit rate.
         *  Measurement unit: time quanta
         */
        uint32_t ph1:6;
        /** ph2 : R/W; bitpos: [18:13]; default: 5;
         *  Configures the phase 2 segment of nominal bit rate.
         *  Measurement unit: time quanta
         */
        uint32_t ph2:6;
        /** brp : R/W; bitpos: [26:19]; default: 10;
         *  Configures the baud-rate prescaler of nominal bit rate.
         *  Measurement unit: cycle of core clock.
         */
        uint32_t brp:8;
        /** sjw : R/W; bitpos: [31:27]; default: 2;
         *  Represents the synchronization jump width in nominal bit time.
         *  Measurement unit: time quanta
         */
        uint32_t sjw:5;
    };
    uint32_t val;
} twaifd_btr_reg_t;

